/*
    ------------------------------------------------------
    3d点检设备-WEB界面数据格式文档
    作者:z
    版本：1.0
    时间：2018-08-14
    ------------------------------------------------------
*/  
// -------------------------------------------------------------实时监控 Start----------------------------------------------------------------
/*
    ------------------------------------------------------
    [模块名]：设备监控
    [交互方式]POST 在线
    [URL]:http://[ip][port]/set/equipmentMonitoring/ 
    *URL地址可以不用此地址,只做参考
    [参数]：
        userNumber:001  //用户编号
        type:0          //占位参数
        model:GDX2      //机型
    [返回]
        form:form       //详情看下方    
    -------------------------------------------------------
    
    [form]：
    {
       
        basics:[ //头部基础参数
            {
                key:"部门名称",
                vlue:"制造一部"
            },
            {
                key:"机组名称",
                vlue:"11#包装机"
            }
        ],
        table:{ //表格对象
            number:"",  //表格编号
            type:"",    //表格类型
            row:[   //行数
                {
                    number:"",  //行编号
                    type:"",    //行类型
                    col:[
                        {
                            text:"小包机机器速度",
                            number:"001",   //列编号
                            type:"text" //列类型    text:文本 img：图片 chars:矢量图   check:选择
                        },
                        {
                            text:"376(包/分)",
                            number:"002",   //列编号
                            type:"text" //列类型    text:文本 img：图片 chars:矢量图   check:选择
                        }
                    ]
                },
                {
                    number:"",  //行编号
                    type:"",    //行类型
                    col:[
                        {
                            text:"小包机机器状态",
                            number:"001",   //列编号
                            type:"text" //列类型    text:文本 img：图片 chars:矢量图   check:选择
                        },
                        {
                            text:"运行",
                            number:"002",   //列编号
                            type:"text" //列类型    text:文本 img：图片 chars:矢量图   check:选择
                        }
                    ]
                }
            ]
        }
    }
*/
/*
    ------------------------------------------------------
    [模块名]：生产监控
    [交互方式]POST 在线
    [URL]:http://[ip][port]/set/productionMonitoring/
    [参数]：
        userNumber:001  //用户编号  
        type:0          //占位参数
        model:GDX2      //机型
    [返回]
        form:form       //详情看下方
    -------------------------------------------------------
    [form]：
    {
       
        basics:[ //头部基础参数
            {
                key:"部门名称",
                vlue:"制造一部"
            },
            {
                key:"机组名称",
                vlue:"11#包装机"
            }
        ],
        table:{ //表格对象
            number:"",  //表格编号
            type:"",    //表格类型
            row:[   //行数
                {
                    number:"",  //行编号
                    type:"",    //行类型
                    col:[
                        {
                            text:"小包机机器速度",
                            number:"001",   //列编号
                            type:"text" //列类型    text:文本 img：图片 chars:矢量图   check:选择
                        },
                        {
                            text:"376(包/分)",
                            number:"002",   //列编号
                            type:"text" //列类型    text:文本 img：图片 chars:矢量图   check:选择
                        }
                    ]
                },
                {
                    number:"",  //行编号
                    type:"",    //行类型
                    col:[
                        {
                            text:"小包机机器状态",
                            number:"001",   //列编号
                            type:"text" //列类型    text:文本 img：图片 chars:矢量图   check:选择
                        },
                        {
                            text:"运行",
                            number:"002",   //列编号
                            type:"text" //列类型    text:文本 img：图片 chars:矢量图   check:选择
                        }
                    ]
                }
            ]
        }
    }
*/
/*
    ------------------------------------------------------
    [模块名]：物料监控
    [交互方式]POST 在线
    [URL]:http://[ip][port]/set/materialMonitoring/
    [参数]：
        userNumber:001  //用户编号
        type:0          //占位参数
        model:GDX2      //机型
    [返回]
        form:form       //详情看下方
    -------------------------------------------------------
    [form]：
    {
       
        basics:[ //头部基础参数
            {
                key:"部门名称",
                vlue:"制造一部"
            },
            {
                key:"机组名称",
                vlue:"11#包装机"
            }
        ],
        table:{ //表格对象
            number:"",  //表格编号
            type:"",    //表格类型
            row:[   //行数
                {
                    number:"",  //行编号
                    type:"",    //行类型
                    col:[
                        {
                            text:"小包机机器速度",
                            number:"001",   //列编号
                            type:"text" //列类型    text:文本 img：图片 chars:矢量图   check:选择
                        },
                        {
                            text:"376(包/分)",
                            number:"002",   //列编号
                            type:"text" //列类型    text:文本 img：图片 chars:矢量图   check:选择
                        }
                    ]
                },
                {
                    number:"",  //行编号
                    type:"",    //行类型
                    col:[
                        {
                            text:"小包机机器状态",
                            number:"001",   //列编号
                            type:"text" //列类型    text:文本 img：图片 chars:矢量图   check:选择
                        },
                        {
                            text:"运行",
                            number:"002",   //列编号
                            type:"text" //列类型    text:文本 img：图片 chars:矢量图   check:选择
                        }
                    ]
                }
            ]
        }
    }
*/
// -------------------------------------------------------------实时监控 End----------------------------------------------------------------

// -------------------------------------------------------------统计分析 Start----------------------------------------------------------------
/*
    ------------------------------------------------------
    [模块名]：实时统计
    [交互方式]POST 在线 
    [URL]:http://[ip][port]/set/realTimeStatistics/
    [参数]：
        userNumber:001  //用户编号
        type:0          //占位参数
        model:GDX2      //机型
        formType:1      //报表类型   1：生产报表    2：质量报表     3：设备报表     4：物料报表   
        itemType:001    //底部选择按钮 编号
    [返回]
        form:form       //详情看下方
    -------------------------------------------------------
    [form]：
    {
       
        basics:[ //头部基础参数序列
            {
                key:"部门名称",
                vlue:"制造一部"
            },
            {
                key:"机组名称",
                vlue:"11#包装机"
            }
        ],
        item:[ //底部按钮序列
            {
                number:"001",
                name:"模盒"
            },
            {
                number:"002",
                name:"小包机出口"
            }
        ],
        materialData:{    //[!]此属性在物料报表条件下存在
            norm:[  //指标
                {
                    name:"产量",
                    number:"001",
                    sop:"29316(包)",//值
                    company:"包"      //单位
                },
                {
                    name:"烟支投入总量",
                    number:"002",
                    sop:"594100(支)",//进度
                    company:"支"      //单位
                }
            ]
        },
        productionData:{  //[!]此属性在生产报表条件下存在
            plan:"",//计划产量
            Actual："",//实际产量
            sop:"",//进度
            norm:[  //指标
                {
                    name:"设备利用率",
                    number:"001",
                    sop:"73.28%",//进度
                },
                {
                    name:"生产效率",
                    number:"002",
                    sop:"94.27%",//进度
                }
            ]
        },
        chars:{//图表数据  
            title:{
                "name":"工序产能统计图",
                "color":""
            },              //图形标题  不可为空
            text:[    //type  line 折线图  bar  柱形图     color图形颜色
                {
                    "name":"工序产能统计图",
                    color:'#558ed5',
                    type:"line",
                    "value":[8650, 8450, 8470, 8350, 8100, 8280]
                }
            ],
            name:['第一小时', '第二小时', '第三小时', '第四小时', '第五小时', '第六小时'],      //图形点对应名称
            max:['600'],               //最大值       数值必须比图形中显示的最大数值要大    如需展示双线不同展示单位时传两个值
            min:['0'],    //最小值
            company:["张"],             //数组 展示单位   展示双线不同展示单位时需传两个单位值
        }

        chars2:{//[!]此属性在质量报表条件下存在  圆饼图 
            title: {
                "name": "剔除状况",
                "color": "gray"
            }, //图形标题  不可为空
            text: [ //name 名称 value值 color对应颜色
                {
                    name: "30%CH剔除",
                    value: "30",
                    color: "blue"
                },
                {
                    name: "11%CT剔除",
                    value: "11",
                    color: "green"
                },
                {
                    name: "53%小包机出口剔除",
                    value: "53",
                    color: "gray"
                },
                {
                    name: "6%模盒烟剔除",
                    value: "6",
                    color: "red"
                },
            ]
        }
    }
*/

/*
    ------------------------------------------------------
    [模块名]：生产看板
    [交互方式]POST 在线 
    [URL]:http://[ip][port]/set/productionKanban/
    [参数]：
        userNumber:001  //用户编号
        type:0          //占位参数
        model:GDX2      //机型
    [返回]
        form:form       //详情看下方
    -------------------------------------------------------
    [form]：
    {
        basics:[ //头部基础参数
            {
                key:"部门名称",
                vlue:"制造一部"
            },
            {
                key:"机组名称",
                vlue:"11#包装机"
            }
        ],
        productionData:[
            {
                key:"包装机停机时间",
                value："00：23：49",
                color:"#fff",//字体颜色
                icon:"1"//图标 1:停机 2:产量 3:箱子
                company:"date"      //单位
            },
            {
                key:"当班实时产量",
                value："30530",
                color:"#fff",//字体颜色
                icon:"2"//图标 1:停机 2:产量 3:箱子
                company:"盒"      //单位
            }
        ],
        materialData:[
            {
                key:"小透拉带(米/箱)",
                value："415.59",
                color:"red",//字体颜色
                icon:"3"//图标 1:停机 2:产量 3:箱子
                company:"米/箱"      //单位
            },
            {
                key:"铝箔纸(米/箱)",
                value："30530",
                color:"#fff",//字体颜色
                icon:"3"//图标 1:停机 2:产量 3:箱子
                company:"米/箱"      //单位
            }
        ]
    }
*/
// -------------------------------------------------------------统计分析 End----------------------------------------------------------------